In [1]:
getwd()

[1] "/Users/macos/Desktop/LDS7/Bai_tap/Chapter_9"

In [3]:
df = read.table('Chapter9/Du_lieu/Table6.txt',
               skip = 1,
               header = TRUE,
               flush = TRUE,
               comment.char = '@',
               stringsAsFactors = FALSE)

In [5]:
head(df)

  Name   Age Height Weight Sex
1 Alex   25  177    57     F
2 Lilly  31  163    69     F
3 Mark   23  190    83     M
4 Oliver 52  179    75     M
5 Martha 76  163    70     F
6 Lucas  49  183    83     M

In [6]:
nrow(df)

[1] 105

In [8]:
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.1.2     ✔ dplyr   1.0.7
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [9]:
# loai bo dong bi trung:
# distinct()
distinct(df)

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [10]:
# loai bo dong bi trung:
# unique()
unique(df)

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F